views/layouts/header.php

SELECT * FROM "users" WHERE "id"=1
SELECT * FROM "hr_employees" WHERE "id"=1
---
                        <img src="<?= $directoryAsset ?>/img/user2-160x160.jpg" class="user-image" alt="User Image"/>
                        <span class="hidden-xs"><?php
                            $id = Yii::$app->user->identity->id;
                            $user = \app\models\Users::find()->where(['id' => $id])->one();
                            $employee = $user->hrEmployee->first_name . ' ' . $user->hrEmployee->last_name;