controllers/ClientsController.php

    protected function findModel($id)
    {
        if (($model = RefClients::findOne(['id' => $id])) !== null) {
---
SELECT * FROM "ref_clients" WHERE "id"='3'