controllers/DocOutgoingController.php

    protected function findModel($id)
    {
        if (($model = WmsDocuments::findOne(['id' => $id])) !== null) {
---
SELECT * FROM "wms_documents" WHERE "id"='47'