controllers/ProductsController.php

SELECT * FROM "ref_products" WHERE "id"='35'
---
    protected function findModel($id)
    {
        if (($model = RefProducts::findOne(['id' => $id])) !== null) {