views/doc-outgoing/view.php

            <tr>
                <td>Masul shaxs: <b>
                        <?php
                        $user = \app\models\Users::find()->where(['id' => $model->created_by])->one();
                        $employee = $user->hrEmployee->first_name . ' ' . $user->hrEmployee->last_name;
---
SELECT * FROM "users" WHERE "id"=1
SELECT * FROM "hr_employees" WHERE "id"=1