models/HrDepartments.php

    public static function getDepartment($id = null){
        if ($id !== null){
            $model = self::findOne($id);
        }
        else{
            $model = ArrayHelper::map(self::find()->all(), 'id', 'name');
---
SELECT * FROM "hr_departments"