models/RefCurrencyType.php

SELECT "id", "name" FROM "ref_currency_type" WHERE "status"=1
---
    public static function getCurrencyTypeList()
    {
        $list = self::find()->select(['id', 'name'])->where(['status' => self::STATUS_ACTIVE])->asArray()->all();