models/RefCategories.php

SELECT * FROM "ref_categories" WHERE "id"=3
---
    public static function getListCategory($id = null){
        if ($id !== null){
            $data = self::findOne($id)['name'];