models/RefProducts.php

SELECT * FROM "ref_products"
---
    public static function getProduct($id = null){
        if ($id !== null){
            $model = self::findOne($id);
        }
        else{
            $model = ArrayHelper::map(self::find()->all(), 'id', 'name');