models/RefUnitType.php

SELECT "id", "name" FROM "ref_unit_type" WHERE "status"=1
---
    public  static function getUnitTypeList()
    {
        $list = self::find()->select(['id', 'name'])->where(['status' => self::STATUS_ACTIVE])->asArray()->all();