models/Users.php

SELECT * FROM "users" WHERE ("id"=1) AND ("status"=1)
---
    public static function findIdentity($id)
    {
        return Users::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM "users" WHERE ("username"='admin') AND ("status"=1)
---
    public static function findByUsername($username)
    {
        return Users::findOne([
            'username' => $username,
            'status' => self::STATUS_ACTIVE,
        ]);